[
    {
        "title": "Citizen Science Developer",
        "link": "https://www.zooniverse.org/",
        "organisation": "Zooniverse, University of Oxford, UK",
        "startDate": "October 2014",
        "endDate": "Present",
        "partial": "zooniverse"
    },
    {
        "title": "Front End Developer",
        "link": "http://www.incuna.com/",
        "organisation": "Incuna Ltd, Oxford, UK",
        "startDate": "November 2012",
        "endDate": "September 2014",
        "description": [
            "At Incuna, I primarily built iPad apps using Backbone, Sass, and Grunt, and wrapping them in Cordova. I later streamlined this process by creating a custom Yeoman generator for new projects.",
            "In addition, I built several responsive single page apps using Angular, and added D3 to produce dynamic data visualisations. I also worked on the front end for a number of Django websites."
        ]
    },
    {
        "title": "Campaign Web Editor",
        "link": "http://www.campaign.ox.ac.uk/",
        "organisation": "University of Oxford Development Office, Oxford, UK",
        "startDate": "March 2010",
        "endDate": "October 2012",
        "description": [
            "I developed, maintained and wrote content for several internal and external websites, all on different platforms. I also took on extra development opportunities where possible, building several WordPress sites with custom themes for special projects.",
            "I also gained some experience in print design while creating various internal communications documents, and shooting video content for the websites."
        ]
    },
    {
        "title": "Staff Writer",
        "link": "http://mainichi.jp/english/",
        "organisation": "The Mainichi Newspapers Co., Tokyo, Japan",
        "startDate": "March 2006",
        "endDate": "March 2010",
        "description": [
            "My primary roles were news gathering, writing and editing in both Japanese and English, translation, and photography. I also worked on a Javascript-driven bilingual comic series, and built a custom article archive for the site using KohanaPHP and MySQL."
        ]
    }
]
